import Foundation

struct CityStruct : Identifiable,Hashable{
    let id = UUID()
    let city: String
    let trainStations: [String]
}

extension CityStruct {
    static let mockCities: [CityStruct] = [
        CityStruct(
            city: "Москва",
            trainStations: [
                "Курский вокзал",
                "Казанский вокзал",
                "Ярославский вокзал",
                "Ленинградский вокзал",
                "Киевский вокзал",
                "Павелецкий вокзал",
                "Рижский вокзал",
                "Белорусский вокзал",
                "Савеловский вокзал"
            ]
        ),
        
        CityStruct(
            city: "Санкт-Петербург",
            trainStations: [
                "Московский вокзал",
                "Ладожский вокзал",
                "Финляндский вокзал",
                "Балтийский вокзал",
                "Витебский вокзал"
            ]
        ),
        
        CityStruct(
            city: "Новосибирск",
            trainStations: [
                "Новосибирск-Главный",
                "Новосибирск-Южный",
                "Новосибирск-Западный"
            ]
        ),
        
        CityStruct(
            city: "Екатеринбург",
            trainStations: [
                "Екатеринбург-Пассажирский",
                "Екатеринбург-Сортировочный",
                "Станция Шарташ"
            ]
        ),
        
        CityStruct(
            city: "Казань",
            trainStations: [
                "Казань-Пассажирская",
                "Восстание-Пассажирская",
                "Станция Казань-2"
            ]
        ),
        
        CityStruct(
            city: "Нижний Новгород",
            trainStations: [
                "Нижний Новгород-Московский",
                "Нижний Новгород-Сортировочный",
                "Станция Мыза"
            ]
        ),
        
        CityStruct(
            city: "Челябинск",
            trainStations: [
                "Челябинск-Главный",
                "Челябинск-Южный",
                "Станция Шершни"
            ]
        ),
        
        CityStruct(
            city: "Самара",
            trainStations: [
                "Самара-Пассажирская",
                "Самара-Безымянка",
                "Станция Кряж"
            ]
        ),
        
        CityStruct(
            city: "Омск",
            trainStations: [
                "Омск-Пассажирский",
                "Омск-Пригородный",
                "Станция Московка"
            ]
        ),
        
        CityStruct(
            city: "Ростов-на-Дону",
            trainStations: [
                "Ростов-Главный",
                "Ростов-Товарный",
                "Станция Первомайская"
            ]
        )
    ]
}

